[Killed] BlockStatement
Jest/jest-7/src/index.js:3:36
 module.exports = class Index {
 
-  example1(status=true, type=true) {
-    if (status && type) return 'HOJE TALVEZ';
-    if (type && !status) return 'HOJE SIM';
-    if (status && !type) return 'HOJE NÃO';
-    return '';
-  }
+  example1(status=true, type=true) {}
 
   example2(link) {

[Killed] BooleanLiteral
Jest/jest-7/src/index.js:3:30
 module.exports = class Index {
 
-  example1(status=true, type=true) {
+  example1(status=true, type=false) {
     if (status && type) return 'HOJE TALVEZ';
     if (type && !status) return 'HOJE SIM';

[Killed] LogicalOperator
Jest/jest-7/src/index.js:4:9
 module.exports = class Index {
 
   example1(status=true, type=true) {
-    if (status && type) return 'HOJE TALVEZ';
+    if (status || type) return 'HOJE TALVEZ';
     if (type && !status) return 'HOJE SIM';
     if (status && !type) return 'HOJE NÃO';

[Killed] ConditionalExpression
Jest/jest-7/src/index.js:4:9
 module.exports = class Index {
 
   example1(status=true, type=true) {
-    if (status && type) return 'HOJE TALVEZ';
+    if (false) return 'HOJE TALVEZ';
     if (type && !status) return 'HOJE SIM';
     if (status && !type) return 'HOJE NÃO';

[Killed] ConditionalExpression
Jest/jest-7/src/index.js:5:9
 
   example1(status=true, type=true) {
     if (status && type) return 'HOJE TALVEZ';
-    if (type && !status) return 'HOJE SIM';
+    if (true) return 'HOJE SIM';
     if (status && !type) return 'HOJE NÃO';
     return '';

[Killed] ConditionalExpression
Jest/jest-7/src/index.js:5:9
 
   example1(status=true, type=true) {
     if (status && type) return 'HOJE TALVEZ';
-    if (type && !status) return 'HOJE SIM';
+    if (false) return 'HOJE SIM';
     if (status && !type) return 'HOJE NÃO';
     return '';

[Killed] LogicalOperator
Jest/jest-7/src/index.js:6:9
   example1(status=true, type=true) {
     if (status && type) return 'HOJE TALVEZ';
     if (type && !status) return 'HOJE SIM';
-    if (status && !type) return 'HOJE NÃO';
+    if (status || !type) return 'HOJE NÃO';
     return '';
   }

[Killed] ConditionalExpression
Jest/jest-7/src/index.js:6:9
   example1(status=true, type=true) {
     if (status && type) return 'HOJE TALVEZ';
     if (type && !status) return 'HOJE SIM';
-    if (status && !type) return 'HOJE NÃO';
+    if (true) return 'HOJE NÃO';
     return '';
   }

[Killed] BlockStatement
Jest/jest-7/src/index.js:10:18
     return '';
   }
 
-  example2(link) {
-    if (link != null && link.includes('AAA')) {
-      return true;
-    }
-    return false;
-  }
+  example2(link) {}
 
 }

[Killed] ConditionalExpression
Jest/jest-7/src/index.js:11:9
   }
 
   example2(link) {
-    if (link != null && link.includes('AAA')) {
+    if (false && link.includes('AAA')) {
       return true;
     }

[Killed] ConditionalExpression
Jest/jest-7/src/index.js:11:9
   }
 
   example2(link) {
-    if (link != null && link.includes('AAA')) {
+    if (false) {
       return true;
     }

[Killed] BooleanLiteral
Jest/jest-7/src/index.js:12:14
 
   example2(link) {
     if (link != null && link.includes('AAA')) {
-      return true;
+      return false;
     }
     return false;
